In [15]:
import sqlite3
from sqlite3 import Error

def select_all_tasks(conn, query1):
    cur = conn.cursor()
    cur.execute(query1)
    rows = cur.fetchall()
    for row in rows:
        print(row)
    
database = "C:\\Users\\rxbro\\Documents\\Country Club case study\\sqlite_db_pythonsqlite.db"
conn = sqlite3.connect(database)

<i> Q1 </i>
<p> Some of the facilities charge a fee to members, but some do not.  Write a SQL query to produce a list of the names of the facilities that do.</p>

In [17]:
query1 = """
SELECT name
FROM Facilities
WHERE membercost > 0
"""
with conn:
    select_all_tasks(conn, query1)

('Tennis Court 1',)
('Tennis Court 2',)
('Massage Room 1',)
('Massage Room 2',)
('Squash Court',)

<b><i>Q2:</i></b>
<p>How many facilities do not charge a fee to members?</p>

In [18]:
query = """
SELECT COUNT(*)
FROM Facilities
WHERE membercost = 0
"""
with conn:
    select_all_tasks(conn, query)

(4,)

<b>Q3:</b>
<p>Write an SQL query to show a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost.  Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.</p>

In [19]:
query = """
SELECT facid, name, membercost, monthlymaintenance
FROM Facilities
WHERE membercost > 0 AND membercost < 0.2 * monthlymaintenance
"""
with conn:
    select_all_tasks(conn, query)

(0, 'Tennis Court 1', 5, 200)
(1, 'Tennis Court 2', 5, 200)
(4, 'Massage Room 1', 9.9, 3000)
(5, 'Massage Room 2', 9.9, 3000)
(6, 'Squash Court', 3.5, 80)

<b>Q4:</b>
<p>Write an SQL query to retrieve the details of facilities with ID 1 and 5.  Try writing the query without using the OR operator.</p>

In [20]:
query = """
SELECT *
FROM Facilities
WHERE facid IN (1, 5)
"""
with conn:
    select_all_tasks(conn, query)

(1, 'Tennis Court 2', 5, 25, 8000, 200)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)

<b>Q5:</b>
<p>Produce a list of facilities, with each labelled as 'cheap' or 'expensive", depending on if their monthly maintenance cost is more than $100.  Return the hame and monthly maintenance of the facilities in question.</p>

In [21]:
query = """ 
SELECT name, monthlymaintenance,
    CASE WHEN monthlymaintenance < 100 THEN 'cheap'
        ELSE 'expensive' END AS cost_qual
FROM Facilities
"""
with conn:
    select_all_tasks(conn, query)

('Tennis Court 1', 200, 'expensive')
('Tennis Court 2', 200, 'expensive')
('Badminton Court', 50, 'cheap')
('Table Tennis', 10, 'cheap')
('Massage Room 1', 3000, 'expensive')
('Massage Room 2', 3000, 'expensive')
('Squash Court', 80, 'cheap')
('Snooker Table', 15, 'cheap')
('Pool Table', 15, 'cheap')

<b>Q6:</b>
<p> You would like to get the first and last name of the last member(s) who signed up.  Try not to use the LIMIT clause for the solution. </p>

In [22]:
query = """
SELECT surname, firstname
FROM Members
ORDER BY memID DESC
"""
with conn:
    cur = conn.cursor()
    cur.execute(query)
    rows = cur.fetchall()
    for i in range(0, 5):
        print(rows[i])

('Smith', 'Darren')
('Crumpet', 'Erica')
('Hunt', 'John')
('Tupperware', 'Hyacinth')
('Purview', 'Millicent')

<b>Q7:</b>
<p>Produce a list of all members who have used a tennis court.  Include in your output the name of the court, and the name of the member formatted in a single column.  Ensure no duplicate data and order by member name.</p>

In [23]:
query = """
SELECT DISTINCT f.name as fac_name, (m.firstname || ' ' || m.surname) as full_name
FROM Facilities f
INNER JOIN Bookings as b USING (facid)
INNER JOIN Members as m USING(memid)
WHERE f.facid IN(0, 1)
ORDER BY full_name
"""
with conn:
    select_all_tasks(conn, query)

('Tennis Court 1', 'Anne Baker')
('Tennis Court 2', 'Anne Baker')
('Tennis Court 2', 'Burton Tracy')
('Tennis Court 1', 'Burton Tracy')
('Tennis Court 1', 'Charles Owen')
('Tennis Court 2', 'Charles Owen')
('Tennis Court 2', 'Darren Smith')
('Tennis Court 1', 'David Farrell')
('Tennis Court 2', 'David Farrell')
('Tennis Court 2', 'David Jones')
('Tennis Court 1', 'David Jones')
('Tennis Court 1', 'David Pinker')
('Tennis Court 1', 'Douglas Jones')
('Tennis Court 1', 'Erica Crumpet')
('Tennis Court 2', 'Florence Bader')
('Tennis Court 1', 'Florence Bader')
('Tennis Court 2', 'GUEST GUEST')
('Tennis Court 1', 'GUEST GUEST')
('Tennis Court 1', 'Gerald Butters')
('Tennis Court 2', 'Gerald Butters')
('Tennis Court 2', 'Henrietta Rumney')
('Tennis Court 1', 'Jack Smith')
('Tennis Court 2', 'Jack Smith')
('Tennis Court 1', 'Janice Joplette')
('Tennis Court 2', 'Janice Joplette')
('Tennis Court 2', 'Jemima Farrell')
('Tennis Court 1', 'Jemima Farrell')
('Tennis Court 1', 'Joan Coplin')
('Tennis Court 1', 'John Hunt')
('Tennis Court 2', 'John Hunt')
('Tennis Court 1', 'Matthew Genting')
('Tennis Court 2', 'Millicent Purview')
('Tennis Court 2', 'Nancy Dare')
('Tennis Court 1', 'Nancy Dare')
('Tennis Court 2', 'Ponder Stibbons')
('Tennis Court 1', 'Ponder Stibbons')
('Tennis Court 2', 'Ramnaresh Sarwin')
('Tennis Court 1', 'Ramnaresh Sarwin')
('Tennis Court 2', 'Tim Boothe')
('Tennis Court 1', 'Tim Boothe')
('Tennis Court 2', 'Tim Rownam')
('Tennis Court 1', 'Tim Rownam')
('Tennis Court 2', 'Timothy Baker')
('Tennis Court 1', 'Timothy Baker')
('Tennis Court 1', 'Tracy Smith')
('Tennis Court 2', 'Tracy Smith')

<b>Q8:</b>
<p> Produce a list of bookings on the date of 2012-09-14 which will cost the member (or guest) more than $30.  Remember that guests have different costs to members (the listed costs are per half-hour 'slot'), and the guest user's ID is always 0.  Include in your output the name of the facility, the name of the member formatted in a single column, and the cost.  Order by descending cost, and do not use any subqueries.</p>

In [24]:
query = """
SELECT f.name, (m.firstname || ' ' || m.surname) as full_name,
    CASE WHEN b.memid = 0 THEN f.guestcost * b.slots
        ELSE f.membercost * b.slots END AS cost_booking
FROM Bookings as b
INNER JOIN Facilities as f USING (facid)
INNER JOIN Members as m USING(memid)
WHERE b.starttime LIKE '2012-09-14%' AND (f.membercost * b.slots > 30 OR (f.guestcost * b.slots > 30 AND b.memid = 0))
ORDER BY cost_booking DESC
"""
with conn:
    select_all_tasks(conn, query)

('Massage Room 2', 'GUEST GUEST', 320)
('Massage Room 1', 'GUEST GUEST', 160)
('Massage Room 1', 'GUEST GUEST', 160)
('Massage Room 1', 'GUEST GUEST', 160)
('Tennis Court 2', 'GUEST GUEST', 150)
('Tennis Court 1', 'GUEST GUEST', 75)
('Tennis Court 1', 'GUEST GUEST', 75)
('Tennis Court 2', 'GUEST GUEST', 75)
('Squash Court', 'GUEST GUEST', 70.0)
('Massage Room 1', 'Jemima Farrell', 39.6)
('Squash Court', 'GUEST GUEST', 35.0)
('Squash Court', 'GUEST GUEST', 35.0)

<b>Q9:</b>
<p>Produce the same result as Q8, but use a subquery.</p>

In [25]:
query = """
SELECT f.name, (m.firstname || ' ' || m.surname) as full_name,
    (f.guestcost * fac_slot.guest_slot + f.membercost * fac_slot.mem_slot) as tot_cost
FROM (
    SELECT bookid, memid, facid, ifnull(mem_slot, 0) as mem_slot, ifnull(guest_slot, 0) as guest_slot
    FROM (
        WITH guest_b AS (
            SELECT bookid, memid, facid, slots
            FROM Bookings
            WHERE memid = 0),
        mem_b AS (
            SELECT bookid, memid, facid, slots
            FROM Bookings
            WHERE memid != 0)
        SELECT b.bookid, b.memid, b.facid, mem_b.slots AS mem_slot, guest_b.slots AS guest_slot
        FROM Bookings AS b
        LEFT JOIN mem_b ON mem_b.bookid = b.bookid
        LEFT JOIN guest_b ON guest_b.bookid = b.bookid
        WHERE b.starttime LIKE '2012-09-14%')) as fac_slot
INNER JOIN Members AS m USING (memid)
INNER JOIN Facilities AS f USING (facid)
WHERE tot_cost > 30
ORDER BY tot_cost DESC
"""
with conn:
    select_all_tasks(conn, query)

('Massage Room 2', 'GUEST GUEST', 320.0)
('Massage Room 1', 'GUEST GUEST', 160.0)
('Massage Room 1', 'GUEST GUEST', 160.0)
('Massage Room 1', 'GUEST GUEST', 160.0)
('Tennis Court 2', 'GUEST GUEST', 150)
('Tennis Court 1', 'GUEST GUEST', 75)
('Tennis Court 1', 'GUEST GUEST', 75)
('Tennis Court 2', 'GUEST GUEST', 75)
('Squash Court', 'GUEST GUEST', 70.0)
('Massage Room 1', 'Jemima Farrell', 39.6)
('Squash Court', 'GUEST GUEST', 35.0)
('Squash Court', 'GUEST GUEST', 35.0)

<b>Q10:</b>
<p>Produce a list of facilities with a total revenue less than $1000.  The output of facility name and total revenue, sorted by revenue.  Remember that there's a different cost for guests and members!</p>

In [33]:
query = """
SELECT name, SUM(
    CASE WHEN memid = 0 THEN guestcost
        ELSE membercost END) AS revenue
    FROM Facilities
    INNER JOIN Bookings USING (facid)
    GROUP BY name
    HAVING revenue < 1000
    ORDER BY revenue
"""
with conn:
    select_all_tasks(conn,query)

('Table Tennis', 90)
('Snooker Table', 115)
('Pool Table', 265)
('Badminton Court', 604.5)

<b>Q11:</b>
<p>Produce a report of members and who recommended them in alphabetic order by surname.</p>

In [34]:
query = """
SELECT m1.surname, m1.firstname, m2.surname, m2.firstname
FROM Members AS m1
INNER JOIN Members AS m2 ON m1.recommendedby = m2.memid
ORDER BY m1.surname, m1.firstname
"""
with conn:
    select_all_tasks(conn, query)

('Bader', 'Florence', 'Stibbons', 'Ponder')
('Baker', 'Anne', 'Stibbons', 'Ponder')
('Baker', 'Timothy', 'Farrell', 'Jemima')
('Boothe', 'Tim', 'Rownam', 'Tim')
('Butters', 'Gerald', 'Smith', 'Darren')
('Coplin', 'Joan', 'Baker', 'Timothy')
('Crumpet', 'Erica', 'Smith', 'Tracy')
('Dare', 'Nancy', 'Joplette', 'Janice')
('Genting', 'Matthew', 'Butters', 'Gerald')
('Hunt', 'John', 'Purview', 'Millicent')
('Jones', 'David', 'Joplette', 'Janice')
('Jones', 'Douglas', 'Jones', 'David')
('Joplette', 'Janice', 'Smith', 'Darren')
('Mackenzie', 'Anna', 'Smith', 'Darren')
('Owen', 'Charles', 'Smith', 'Darren')
('Pinker', 'David', 'Farrell', 'Jemima')
('Purview', 'Millicent', 'Smith', 'Tracy')
('Rumney', 'Henrietta', 'Genting', 'Matthew')
('Sarwin', 'Ramnaresh', 'Bader', 'Florence')
('Smith', 'Jack', 'Smith', 'Darren')
('Stibbons', 'Ponder', 'Tracy', 'Burton')
('Worthington-Smyth', 'Henry', 'Smith', 'Tracy')

<b>Q12:</b>
<p>Find the facilities with their usage by member, but not guests.</p>

In [35]:
query = """
SELECT name, COUNT(
    CASE WHEN memid > 0 THEN 1
        ELSE NULL END) AS usage
    FROM Facilities AS f
    INNER JOIN Bookings USING (facid)
    GROUP BY name
    ORDER BY usage DESC
"""
with conn:
    select_all_tasks(conn,query)

('Pool Table', 783)
('Snooker Table', 421)
('Massage Room 1', 421)
('Table Tennis', 385)
('Badminton Court', 344)
('Tennis Court 1', 308)
('Tennis Court 2', 276)
('Squash Court', 195)
('Massage Room 2', 27)

<b>Q13:</b>
<p> Find the facilities usage by month, but not by guests.</p>

In [37]:
query = """
SELECT name, strftime('%m', starttime) as month, COUNT(
    CASE WHEN memid > 0 THEN 1
        ELSE NULL END) AS usage
FROM Facilities AS f
INNER JOIN Bookings USING (facid)
GROUP BY name, month
ORDER BY usage DESC
"""
with conn:
    select_all_tasks(conn, query)

('Pool Table', '09', 408)
('Pool Table', '08', 272)
('Snooker Table', '09', 199)
('Table Tennis', '09', 194)
('Massage Room 1', '09', 191)
('Badminton Court', '09', 161)
('Snooker Table', '08', 154)
('Massage Room 1', '08', 153)
('Table Tennis', '08', 143)
('Badminton Court', '08', 132)
('Tennis Court 1', '09', 132)
('Tennis Court 2', '09', 126)
('Tennis Court 1', '08', 111)
('Tennis Court 2', '08', 109)
('Pool Table', '07', 103)
('Squash Court', '09', 87)
('Squash Court', '08', 85)
('Massage Room 1', '07', 77)
('Snooker Table', '07', 68)
('Tennis Court 1', '07', 65)
('Badminton Court', '07', 51)
('Table Tennis', '07', 48)
('Tennis Court 2', '07', 41)
('Squash Court', '07', 23)
('Massage Room 2', '09', 14)
('Massage Room 2', '08', 9)
('Massage Room 2', '07', 4)